app/views/users/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 1]]
---
  <tbody>
    <% @user.comments.each do |comment| %>

SELECT "votes".* FROM "votes" WHERE "votes"."user_id" = ?  [["user_id", 1]]
---
  <tbody>
    <% @user.votes.each do |vote| %>

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ?  [["user_id", 1]]
---
  <ul>
    <% @user.favorites.each do |favorite| %>