app/views/restaurants/index.html.erb

  <div class="form-group">
    <%= form.submit 'Search', disabled: Restaurant.all.empty?, class: 'search-button' %>
---
SELECT 1 AS one FROM "restaurants" LIMIT ?  [["LIMIT", 1]]