app/views/restaurants/index.html.erb

SELECT 1 AS one FROM "restaurants" WHERE (name like '%Subway%') LIMIT ?  [["LIMIT", 1]]
---
    <strong>No restaurants match the search query.</strong>
    <% if Restaurant.all.empty? %>

SELECT 1 AS one FROM "restaurants" LIMIT ?  [["LIMIT", 1]]
---
  <div class="form-group">
    <%= form.submit 'Search', disabled: Restaurant.all.empty? %>