app/views/restaurants/index.html.erb

  <p>
    <% if Restaurant.all.empty? %>
---
SELECT "restaurants".* FROM "restaurants" WHERE (name like '%Cheesecake Factory%' and location like '%DC%')
SELECT 1 AS one FROM "restaurants" LIMIT ?  [["LIMIT", 1]]

  <div class="form-group">
    <%= form.submit 'Search', disabled: Restaurant.all.empty?, class: 'search-button' %>
---
SELECT 1 AS one FROM "restaurants" LIMIT ?  [["LIMIT", 1]]