app/views/restaurants/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."restaurant_id" = ?  [["restaurant_id", 2]]
---
  <h2>&nbsp;Comments</h2>
  &nbsp;<textarea readonly id="comments-output-box"><% @restaurant.comments.each do |comment| %><%= "#{comment}\n" %><% end %></textarea><br>

SELECT "votes".* FROM "votes" WHERE "votes"."restaurant_id" = ?  [["restaurant_id", 7]]
---
      <tbody>
        <% @restaurant.votes.each do |vote| %>