app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
    def set_comment
      @comment = Comment.find(params[:id])

SELECT "restaurants".* FROM "restaurants" WHERE (name like '%Cheesecake%' and location like '%Carrollton%')
---
    def set_restaurant
      session[:restaurant_id] = params[:restaurant_id] || session[:restaurant_id]
      @restaurant = Restaurant.find(session[:restaurant_id])