app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_id", "restaurant_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["restaurant_id", 2], ["body", "testing"], ["created_at", "2023-05-07 17:57:58.485105"], ["updated_at", "2023-05-07 17:57:58.485105"]]
---
  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save