app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_id", "restaurant_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["restaurant_id", 9], ["body", "best pizza"], ["created_at", "2023-05-07 23:09:53.529255"], ["updated_at", "2023-05-07 23:09:53.529255"]]
---
  def create
    if (@restaurant == nil)
      respond_to do |format|
        format.html { redirect_to restaurants_url, notice: "Please select a restaurant to comment on." }
      end

      return
    end

    params[:comment].merge!({restaurant_id: @restaurant.id, user_id: current_user.id})
    @comment = Comment.new(comment_params)


    respond_to do |format|
      if @comment.save

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
    def set_restaurant
      session[:restaurant_id] = params[:restaurant_id] || session[:restaurant_id]
      @restaurant = Restaurant.find(session[:restaurant_id])