app/controllers/favorites_controller.rb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."restaurant_id" = ? LIMIT ?  [["user_id", 980190962], ["restaurant_id", 181803346], ["LIMIT", 1]]
---
    def set_favorite
      @favorite = Favorite.find_by(user_id: params[:user_id], restaurant_id: params[:restaurant_id])