app/controllers/favorites_controller.rb

INSERT INTO "favorites" ("user_id", "restaurant_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["restaurant_id", 2], ["created_at", "2023-05-07 23:09:08.355067"], ["updated_at", "2023-05-07 23:09:08.355067"]]
---
  def create
    @favorite = Favorite.new(favorite_params)

    respond_to do |format|
      if @favorite.save

DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]
---
  def destroy
    @favorite.destroy

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."restaurant_id" = ? LIMIT ?  [["user_id", 1], ["restaurant_id", 2], ["LIMIT", 1]]
---
    def set_favorite
      @favorite = Favorite.find_by(user_id: params[:user_id], restaurant_id: params[:restaurant_id])