app/controllers/restaurants_controller.rb

  def update
    #params[:will_split][:will_not_split] = 0 if params[:will_split][:will_not_split].blank?
    respond_to do |format|
      if @restaurant.update(restaurant_params)
---
UPDATE "restaurants" SET "name" = ?, "location" = ?, "updated_at" = ? WHERE "restaurants"."id" = ?  [["name", "Cheesecake Factory"], ["location", "Carrollton"], ["updated_at", "2023-04-07 06:12:56.399465"], ["id", 113629430]]

  def vote_will_not_split
    respond_to do |format|
      if Restaurant.update(@restaurant[:id],:will_not_split => @restaurant[:will_not_split] + 1)
---
UPDATE "restaurants" SET "will_split" = ?, "updated_at" = ? WHERE "restaurants"."id" = ?  [["will_split", 2], ["updated_at", "2023-04-07 02:19:22.751253"], ["id", 980190962]]

    def set_restaurant
      @restaurant = Restaurant.find(params[:id])
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]