app/controllers/restaurants_controller.rb

  def destroy
    @restaurant.destroy
---
DELETE FROM "restaurants" WHERE "restaurants"."id" = ?  [["id", 1]]