app/controllers/restaurants_controller.rb

  def create
    #params[:will_split][:will_not_split] = 0 if params[:will_split][:will_not_split].blank?
    @restaurant = Restaurant.new(restaurant_params)
    @restaurant.will_split = 0
    @restaurant.will_not_split = 0

    respond_to do |format|
      if @restaurant.save
---
INSERT INTO "restaurants" ("name", "location", "will_split", "will_not_split", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Chipotle3"], ["location", "Newyork3"], ["will_split", 0], ["will_not_split", 0], ["created_at", "2023-04-16 00:44:25.675861"], ["updated_at", "2023-04-16 00:44:25.675861"]]

  def update
    #params[:will_split][:will_not_split] = 0 if params[:will_split][:will_not_split].blank?
    respond_to do |format|
      if @restaurant.update(restaurant_params)
---
UPDATE "restaurants" SET "location" = ?, "updated_at" = ? WHERE "restaurants"."id" = ?  [["location", "Atlanta"], ["updated_at", "2023-04-07 06:19:20.194149"], ["id", 2]]

  def search
    @restaurants = Restaurant.search(name: params[:query_name], location: params[:query_location])
---
SELECT "restaurants".* FROM "restaurants"

  def vote_will_split
    respond_to do |format|
      if Restaurant.update(@restaurant[:id],:will_split => @restaurant[:will_split] + 1)
---
UPDATE "restaurants" SET "will_split" = ?, "updated_at" = ? WHERE "restaurants"."id" = ?  [["will_split", 1], ["updated_at", "2023-04-16 00:44:33.235442"], ["id", 12]]

  def vote_will_not_split
    respond_to do |format|
      if Restaurant.update(@restaurant[:id],:will_not_split => @restaurant[:will_not_split] + 1)
---
UPDATE "restaurants" SET "will_not_split" = ?, "updated_at" = ? WHERE "restaurants"."id" = ?  [["will_not_split", 1], ["updated_at", "2023-04-16 00:44:31.763829"], ["id", 12]]