app/controllers/votes_controller.rb

  def create
    @vote = Vote.new(vote_params)

    respond_to do |format|
      if @vote.save
---
INSERT INTO "votes" ("user_id", "restaurant_id", "will_split?", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["restaurant_id", 2], ["will_split?", 0], ["created_at", "2023-04-17 01:06:19.863312"], ["updated_at", "2023-04-17 01:06:19.863312"]]